Revit 2017 API
RebarConstraint.GetTargetRebarConstraintType Method
 Returns the TargetRebarConstraintType of the handle on the other Rebar Element to which this RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'ToOtherRebar.'
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2014
Syntax
C#
public TargetRebarConstraintType GetTargetRebarConstraintType()
Visual Basic
Public Function GetTargetRebarConstraintType As TargetRebarConstraintType
Visual C++
public:
TargetRebarConstraintType GetTargetRebarConstraintType()
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'ToOtherRebar.'
See Also
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace